### Terraform Result 📝️ `create_mysql_instance_with_public_ip`
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙ ️`success`
#### Terraform Validation 🤖

```
Success! The configuration is valid.


```

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.instance_suffix will be created
  + resource "random_id" "instance_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.random_string will be created
  + resource "random_id" "random_string" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 12
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.test_sql_database_1.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "db-first"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.test_sql_database_2.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "db-second"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.test_sql_database_instance.google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = false
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = (known after apply)
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled = true
              + require_ssl  = true
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.test_sql_user.google_sql_user.users will be created
  + resource "google_sql_user" "users" {
      + host     = "localhost"
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "sql-user"
      + password = (sensitive value)
      + project  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_string                                            = (known after apply)
  + test_sql_database_1_id                                   = (known after apply)
  + test_sql_database_1_self_link                            = (known after apply)
  + test_sql_database_2_id                                   = (known after apply)
  + test_sql_database_2_self_link                            = (known after apply)
  + test_sql_database_instance_private_ip_private_ip_address = (known after apply)
  + test_sql_database_instance_private_ip_public_ip_address  = (known after apply)
  + test_sql_user_name                                       = "sql-user"
  + test_sql_user_password                                   = (sensitive value)
  + test_terraform_sql_connection_name                       = (known after apply)
  + test_terraform_sql_first_ip_address                      = (known after apply)
  + test_terraform_sql_instance_name                         = (known after apply)
  + test_terraform_sql_self_link                             = (known after apply)
  + test_terraform_sql_service_account_email_address         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @poom, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*